Tekla Open API Reference for Tekla Structures 2025
Diameter Methods
The ReinforcingBarFilterExpressions.Diameter type exposes the following members.
Methods
Name | Description
ToString
 Creates a string representation of the current object.
 (Inherited from DataFilterExpression.)
Top
See Also
Reference
ReinforcingBarFilterExpressions.Diameter Class
Tekla.Structures.Filtering.Categories Namespace